# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Settings
cask_args appdir: '/Applications'

# Libs
brew "openssl"
brew 'coreutils'
brew 'md5sha1sum'
brew "ctags"
brew "libxml2"
brew 'keybase'
brew 'libpng'
brew 'freetype'
brew 'ffmpeg'
brew 'readline'

# UNIX Tools
brew 'git'
brew 'ant'
brew 'ack'
brew "tmux"
brew "vim"
brew "zsh"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "httpie"
brew "curl"
brew 'vimpager'
brew 'zsh-completions'
brew 'p7zip'
brew 'grep'
brew 'keybase'
brew 'tree'
brew 'tor'

# Heroku & GitHub
brew 'heroku-toolbelt'
brew 'parity'
brew "hub"
brew 'awscli'

# Docker
brew 'docker'

# Image manipulation
brew "imagemagick"

# Testing
brew "qt"
brew 'jmeter'

# Programming languages
brew "libyaml" # should come after openssl
brew "nvm"
brew "rbenv"
brew "ruby-build"
brew "ruby-default-gems"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
brew "sqlite"
brew "mongodb", restart_service: true
brew "mysql", restart_service: true

# Automation
brew "chromedriver"

# Cask QL Plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webp-quicklook'

# Cask Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-ubuntu'
cask 'font-source-sans-pro'

# Apps
cask '1password'
cask 'alfred'
cask 'alternote'
cask 'adobe-reader'
cask 'whatsapp'
cask 'appcleaner'
cask 'backblaze'
cask 'buffer'
cask 'charles'
cask 'dropbox'
cask 'duet'
cask 'docker'
cask 'flowstate'
cask 'goofy'
cask 'google-drive'
cask 'grammarly'
cask 'istat-menus'
cask 'macaw'
cask 'mongohub'
cask 'omnipresence'
cask 'omnioutliner'
cask 'pocket'
cask 'pixelmator'
cask 'postgres'
cask 'postman'
cask 'rescuetime'
cask 'screenhero'
cask 'suspicious-package'
cask 'transmission'
cask 'vmware-fusion'
cask 'slack'
cask 'github-desktop'
cask 'xquartz'
cask 'mongohub'
cask 'virtualbox'
cask 'vagrant'
cask 'silverlight'
cask 'the-unarchiver'
cask 'firefox'
cask 'google-chrome'
cask 'torbrowser'
cask 'atom'
cask 'sublime-text'
cask 'macdown'
cask 'java'
cask 'evernote'
cask 'skype'
cask 'awaken'
cask 'cloudy'
cask 'flux'
cask 'colorpicker'
cask 'iboostup'
cask 'imagealpha'
cask 'imageoptim'
cask 'kaleidoscope'
cask 'mindnode-pro'
cask 'microsoft-office'
cask 'omnifocus'
cask 'omnifocus-clip-o-tron'
cask 'keyboard-cleaner'
cask 'paparazzi'
cask 'pixelmator'
cask 'ripit'
cask 'sequel-pro'
cask 'skitch'
cask 'sketch'
cask 'sketch-toolbox'
cask 'sketch-tool'
cask 'spotify'
cask 'soapui'
cask 'time-out'
cask 'twitter'
cask 'transmit'
cask 'utorrent'
cask 'vlc'
cask 'recordit'

