# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Settings
cask_args appdir: '/Applications'

# Libs
brew "openssl"
brew 'coreutils'
brew 'md5sha1sum'
brew "ctags"
brew "libxml2"
brew 'keybase'

# UNIX Tools
brew 'git'
brew 'ant'
brew 'ack'
brew "tmux"
brew "vim"
brew "zsh"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "httpie"
brew "curl"
brew 'vimpager'
brew 'zsh-completions'
brew 'p7zip'
brew 'grep'

# Heroku
brew 'heroku-toolbelt'
brew 'parity'

# GitHub
brew "hub"

# Image manipulation
brew "imagemagick"

# Testing
brew "qt"
brew 'jmeter'

# Programming languages
brew "libyaml" # should come after openssl
brew "nvm"
brew "rbenv"
brew "ruby-build"
brew "ruby-default-gems"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
brew "sqlite"
brew "mongodb", restart_service: true
brew "mysql", restart_service: true

# Automation
brew "chromedriver"

# Cask QL Plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webp-quicklook'

# Cask Fonts
cask 'font-source-code-pro'
cask 'font-inconsolata'
cask 'font-ubuntu'
cask 'font-source-sans-pro'

# Apps
cask 'slack'
cask 'github-desktop'
cask 'xquartz'
cask 'mongohub'
cask 'virtualbox'
cask 'vagrant'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Text Editors
cask 'atom'
cask 'sublime-text'
cask 'macdown'

# Java
cask 'java'

# brew 'ant'
# brew 'autoconf'
# brew 'xz'
# brew 'automake'
# brew 'awscli'
# brew 'boost'
# brew 'pcre'
# brew 'carthage'
# brew 'cmake'
# brew 'cscope'
# brew 'pkg-config'
# brew 'makedepend'
# brew 'libgpg-error'
# brew 'libassuan'
# brew 'libgcrypt'
# brew 'libksba'
# brew 'pth'
# brew 'dirmngr'
# brew 'x264'
# brew 'lame'
# brew 'xvid'
# brew 'libpng'
# brew 'freetype'
# brew 'ffmpeg'
# brew 'readline'
# brew 'gdbm'
# brew 'python'
# brew 'gdb'
# brew 'ghi'
# brew 'jpeg'
# brew 'libtiff'
# brew 'little-cms2'
# brew 'ghostscript'
# brew 'gifsicle'
# brew 'gnupg'
# brew 'pinentry'
# brew 'gpg-agent'
# brew 'libusb'
# brew 'libusb-compat'
# brew 'gnupg2'
# brew 'graphviz'
# brew 'lua'
# brew 'highlight'
# brew 'python3'
# brew 'libtool'
# brew 'perl'
# brew 'jbig2dec'
# brew 'keybase'
# brew 'libevent'
# brew 'libvo-aacenc'
# brew 'maven'
# brew 'scons'
# brew 'ossp-uuid'
# brew 'p7zip'
# brew 'qt'
# brew 'spark'
# brew 'tor'
# brew 'tree'
# brew 'unar'

